{
  "settings": {
    "initial_delay_minutes": 5,
    "min_interval_minutes": 15,
    "max_interval_minutes": 30,
    "working_timeout_seconds": 1800
  },
  "questions": [
    "Are you using your potential or wasting your time?",
    "Is this helping you grow or just distracting you?",
    "Are you making progress or just passing the time?",
    "Are you investing in your future or just spending time?",
    "Does this action bring you closer to your goals or keep you stuck?",
    "Is this adding value to your life or just passing time?",
    "Are you building your future or just wasting time?",
    "Are you focusing on growth or just avoiding boredom?",
    "Will this choice lift you up or keep you down?",
    "Are you investing in your potential or wasting it?",
    "Does this help your future success or hinder it?",
    "Are you on the path to your goals or wandering off it?",
    "Is this improving your skills or just killing time?",
    "Are you making real progress or just passing time?",
    "Are you focused on your dreams or getting distracted?",
    "Is this action moving you forward or holding you back?",
    "Are you making meaningful progress or wasting time?",
    "Are you focused on your future or distracted by the present?",
    "Is this action helping your dreams or delaying them?",
    "Is this moment pushing you forward or holding you back?",
    "Are you moving towards your goals or drifting away?",
    "Will this decision support your future or hurt it?",
    "Are you making the most of your time or wasting it?",
    "Is this time spent wisely or wasted?",
    "Is this moment adding to your future or taking away from it?"
  ],
  "motivational_messages": [
    "Time is money, don't waste it.",
    "Time is ticking away.",
    "Stop wasting your time!",
    "You're better than this.",
    "Don't let yourself down.",
    "Every second counts.",
    "Are you really okay with this?",
    "Think about your future.",
    "You're capable of more.",
    "Don't settle for less.",
    "Make your time count.",
    "Don't waste your potential.",
    "You can do better.",
    "Push yourself harder.",
    "Don't let time slip away.",
    "Take control of your time.",
    "Your future self is watching.",
    "Time is precious, don't waste it."
  ],
  "success_message": "Ohh! That's good, you will be successful!"
}